clc
%% 
% x=3:1:9;%x轴上的数据，第一个值代表数据开始，第二个值代表间隔，第三个值代表终止
% a=[54.12	74	93.82	114.74	140.9	173.76 230]; %a数据y值
% b=[58.03	79.67	109.16	143.71	230	230 230]; %b数据y值
% c = [47.75	67.82	87.95	108.45	132.75	161.93	190.05];
% d = [34.80	67.60	87.52	107.99	132.85	162.61	192.69];
% figure,
% plot(x,a,'-*b',x,b,'-or',x,c,'-xg',x,d,'-sk'); %线性，颜色，标记
% axis([2,10,0,240])  %确定x轴与y轴框图大小
% set(gca,'XTick',[2:1:10]) %x轴范围1-6，间隔1
% set(gca,'YTick',[0:20:230]) %y轴范围0-inf，间隔50
% legend('Mushroom','Mannequin','Beetle','Elephant');   %右上角标注
% xlabel('m')  %x轴坐标描述
% ylabel('SNR') %y轴坐标描述
%% 
x=3:1:9;%x轴上的数据，第一个值代表数据开始，第二个值代表间隔，第三个值代表终止
a=[2.09E-03	2.29E-04	2.31E-05	2.08E-06	1.41E-70	1.00E-08	0.00E+00]; %a数据y值
b=[2.26E-03	2.06E-04	1.41E-05	1.00E-06	0.00E+00	0.00E+00	0.00E+00]; %b数据y值
c = [2.35E-03	2.41E-04	2.44E-05	2.28E-06	1.80E-07	1.41E-08	1.20E-09];
d = [3.72E-03	3.27E-04	2.53E-05	2.43E-06	2.35E-07	1.80E-08	1.50E-09];
figure,
plot(x,a,'-*b',x,b,'-or',x,c,'-xg',x,d,'-sk'); %线性，颜色，标记
axis([2,10,0,0.0041])  %确定x轴与y轴框图大小
set(gca,'XTick',[2:1:10]) %x轴范围1-6，间隔1
set(gca,'YTick',[0:0.002,0.005]) %y轴范围0-inf，间隔50
legend('Mushroom','Mannequin','Beetle','Elephant');   %右上角标注
xlabel('m')  %x轴坐标描述
ylabel('Hausdorff distance') %y轴坐标描述